ERP DEV.WMS/src/Documents/вмс_ПроверкаКомплектности/вмс_ПроверкаКомплектности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>вмс_ПроверкаКомплектности</name>
  <registerRecords>AccumulationRegister.вмс_ПотребностьКомплектов</registerRecords>
  <registerRecords>AccumulationRegister.вмс_ПотребностьКомплектующих</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Комплекты</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаТовара</name>
      <type>
        <types>DefinedType.вмс_ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комплектующие</name>
    <attributes>
      <name>ИдентификаторСтрокиКомплекта</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Комплектующая</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаКомплектующей</name>
      <type>
        <types>DefinedType.вмс_ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЗаЕдиницу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP DEV.WMS/src/AccumulationRegisters/вмс_ПотребностьКомплектующих/вмс_ПотребностьКомплектующих.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>вмс_ПотребностьКомплектующих</name>
  <resources>
    <name>Потребность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ДокументПотребности</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>DefinedType.вмс_ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>CatalogRef.вмс_ПартииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.вмс_СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Качество</name>
    <type>
      <types>EnumRef.вмс_КачествоТовара</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Комплектующая</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаКомплектующей</name>
    <type>
      <types>DefinedType.вмс_ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ERP DEV.WMS/src/AccumulationRegisters/вмс_ПотребностьКомплектов/вмс_ПотребностьКомплектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>вмс_ПотребностьКомплектов</name>
  <resources>
    <name>Потребность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ДокументПотребности</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Комплект</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>DefinedType.вмс_ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ERP DEV.WMS/src/Documents/вмс_ПроверкаКомплектности/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Если ЭтоНовый() Тогда
			//сгенерировать уникальный номер в основной базе при загрузке из мобильной базы
			УстановитьНовыйНомер();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)  
			
	КомплектыДокумента = Комплекты.Выгрузить();  
	КомплектыДокумента.Колонки["ХарактеристикаТовара"].Имя = "Характеристика";
	КомплектующиеДокумента = Комплектующие.Выгрузить();
	КомплектующиеДокумента.Колонки["ИдентификаторСтрокиКомплекта"].Имя = "ИдентификаторСтроки";
	КомплектующиеДокумента.Колонки["Количество"].Имя = "КоличествоФакт"; 
	
	СводнаяТаблица = вмс_РаботаСКоллекциями.СоединитьТаблицы(КомплектыДокумента, КомплектующиеДокумента, "ИдентификаторСтроки", "Комплектующая, ХарактеристикаКомплектующей, КоличествоФакт", , Ложь);
	
	Движения.вмс_ПотребностьКомплектующих.Записывать = Истина;
	Для Каждого Строка Из СводнаяТаблица Цикл 
		
		Движение = Движения.вмс_ПотребностьКомплектующих.Добавить();		
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		ЗаполнитьЗначенияСвойств(Движение, Строка);  
		Движение.ДокументПотребности = ДокументОснование;		
		Движение.Период = Дата;
		Движение.Потребность = Строка.КоличествоФакт;
		
	КонецЦикла;  
	
	Движения.вмс_ПотребностьКомплектов.Записывать = Истина; 	
	Для каждого Строка Из Комплекты Цикл 
		
		Движение = Движения.вмс_ПотребностьКомплектов.Добавить();  
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.ДокументПотребности = ДокументОснование;
		Движение.Комплект = Строка.Товар;
		Движение.Характеристика = Строка.ХарактеристикаТовара;
		Движение.Потребность = Строка.Количество;
		
	КонецЦикла; 
	
КонецПроцедуры
